In [2]:
import os
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import talib

In [3]:
amzn=pd.read_csv('AMZN_data.csv',index_col=0)

In [4]:
amzn.head()

                Open      High       Low     Close  Adj Close      Volume
Date
1999-01-04  2.730729  2.966667  2.665625  2.957813   2.957813   785844000
1999-01-05  2.739063  3.243750  2.662500  3.112500   3.112500  1257464000
1999-01-06  3.409375  3.509375  3.350000  3.450000   3.450000   723532000
1999-01-07  3.428125  4.006250  3.325000  3.971875   3.971875   945492000
1999-01-08  4.606250  4.978125  3.800000  4.006250   4.006250  1333244000

In [5]:
amzn.tail()

                 Open       High        Low      Close  Adj Close    Volume
Date
2022-12-23  83.250000  85.779999  82.930000  85.250000  85.250000  57433700
2022-12-27  84.970001  85.349998  83.000000  83.040001  83.040001  57284000
2022-12-28  82.800003  83.480003  81.690002  81.820000  81.820000  58228600
2022-12-29  82.870003  84.550003  82.550003  84.180000  84.180000  54995900
2022-12-30  83.120003  84.050003  82.470001  84.000000  84.000000  62401200

In [6]:
amzn.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6039 entries, 1999-01-04 to 2022-12-30
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       6039 non-null   float64
 1   High       6039 non-null   float64
 2   Low        6039 non-null   float64
 3   Close      6039 non-null   float64
 4   Adj Close  6039 non-null   float64
 5   Volume     6039 non-null   int64
dtypes: float64(5), int64(1)
memory usage: 330.3+ KB

-- ADD 2023 DATA SET
1. Change index date to datetime
2. change columns names to lower case
--- there is no nulls
3. change all decimals for up two-three decimal spaces.
4. create data Dictionary
5. Divide data as Time Series Analysis
5. Data Visualization and exploration
6. machine learning application/modeling/ prediction
7. assess accuracy.

In [18]:
amzn2 = pd.read_csv('AMZN_2023.csv',index_col=0)

In [ ]:
amzn2.

In [26]:
combined_amzn=pd.concat([amzn,amzn2], ignore_index=False)

In [30]:
combined_amzn.to_csv('combined_amzn.csv')

In [33]:
df=pd.read_csv('combined_amzn.csv',index_col=0)

In [34]:
df.head()

                Open      High       Low     Close  Adj Close      Volume
Date
1999-01-04  2.730729  2.966667  2.665625  2.957813   2.957813   785844000
1999-01-05  2.739063  3.243750  2.662500  3.112500   3.112500  1257464000
1999-01-06  3.409375  3.509375  3.350000  3.450000   3.450000   723532000
1999-01-07  3.428125  4.006250  3.325000  3.971875   3.971875   945492000
1999-01-08  4.606250  4.978125  3.800000  4.006250   4.006250  1333244000

In [35]:
df.tail()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2023-12-14,149.929993,150.539993,145.520004,147.419998,147.419998,58400800
2023-12-15,148.380005,150.570007,147.880005,149.970001,149.970001,110039100
2023-12-18,150.559998,154.850006,150.050003,154.070007,154.070007,62512800
2023-12-19,154.399994,155.119995,152.690002,153.789993,153.789993,43171300
2023-12-20,152.899994,155.630005,151.559998,152.119995,152.119995,50258500